In [1]:
import pandas as pd
from itertools import cycle

In [2]:
#Determing csv paths for each

#Climatalogical disasters

climate_csv = "/Users/amber/Desktop/GitHub/ETL-project/disasters_csv/Climatological disasters.csv"

In [3]:
disasters_df = pd.read_csv(climate_csv)
disasters_df

,CountryID,Countries or areas,Occurrence 1990-1999,Occurrence 2000-2009,Occurrence 2010-2019,Total deaths 1990-1999,Total deaths 2000-2009,Total deaths 2010-2019,Persons affected 1990-1999,Persons affected 2000-2009,Persons affected 2010-2019
0,4,Afghanistan,3,3,2,0,37,0,48000,4760000,12350000
1,8,Albania,1,1,...,0,0,...,3200000,75,...
2,12,Algeria,2,1,...,22,8,...,0,0,...
3,24,Angola,4,2,2,0,58,0,2585000,25000,3253900
4,660,Anguilla,1,...,...,0,...,...,0,...,...
...,...,...,...,...,...,...,...,...,...,...,...
148,860,Uzbekistan,...,1,...,...,0,...,...,600000,...
149,862,Venezuela (Bolivarian Republic of),...,1,...,...,0,...,...,0,...
150,704,Viet Nam,3,3,2,0,0,0,4400000,1710000,1750000
151,894,Zambia,4,1,...,0,0,...,2973204,1200000,...
152,716,Zimbabwe,3,2,3,0,0,0,5055000,8100000,13567618

In [4]:
# unpivot using lreshape

data = {'Occurances':['Occurrence 1990-1999','Occurrence 2000-2009','Occurrence 2010-2019'], 'Total Deaths':['Total deaths 1990-1999','Total deaths 2000-2009','Total deaths 2010-2019'], 'Persons Affected':['Persons affected 1990-1999','Persons affected 2000-2009','Persons affected 2010-2019']}

disasters_df_unpivot = pd.lreshape(disasters_df, data)
disasters_df_unpivot

,Countries or areas,CountryID,Occurances,Total Deaths,Persons Affected
0,Afghanistan,4,3,0,48000
1,Albania,8,1,0,3200000
2,Algeria,12,2,22,0
3,Angola,24,4,0,2585000
4,Anguilla,660,1,0,0
...,...,...,...,...,...
454,Uzbekistan,860,...,...,...
455,Venezuela (Bolivarian Republic of),862,...,...,...
456,Viet Nam,704,2,0,1750000
457,Zambia,894,...,...,...
458,Zimbabwe,716,3,0,13567618

In [5]:
# name index, sort by country and index to create sort-ability for adding decades

disasters_df_unpivot.index.name="id"
disasters_df_unpivot.sort_values(by=['Countries or areas', 'id'], inplace=True)
disasters_df_unpivot

    Countries or areas  CountryID Occurances Total Deaths Persons Affected
id
0          Afghanistan          4          3            0            48000
153        Afghanistan          4          3           37          4760000
306        Afghanistan          4          2            0         12350000
1              Albania          8          1            0          3200000
154            Albania          8          1            0               75
..                 ...        ...        ...          ...              ...
304             Zambia        894          1            0          1200000
457             Zambia        894        ...          ...              ...
152           Zimbabwe        716          3            0          5055000
305           Zimbabwe        716          2            0          8100000
458           Zimbabwe        716          3            0         13567618

[459 rows x 5 columns]

In [6]:
# add decades column and cycle through three rows for each country

decades = cycle(['1990-1999','2000-2009','2010-2019'])
disasters_df_unpivot['Decade']=[next(decades) for decade in range(len(disasters_df_unpivot))]

disasters_df_unpivot
disasters_df_unpivot.to_csv('disasters_unpivot.csv')